var full_dialogue = {
    "p11": [
        "> 您是旅行者吗？作为村长的我本该来亲自迎接，但……真不巧，我还在给孩子们授课，实在抽不开身。您此行准备前往哪里？",
        "> 失忆？这……太不妙了…你是从海里来的？这可真稀奇……想必你一定有过什么奇遇吧。",
        "> 总之，如果您想在村子里多停留一段时间，我可以和大家打声招呼，让他们多关照。",
        "> 不过，您最好不要轻易走出村子……没有记忆的话，去村外的原野是很危险的，虽然这附近的数量级都不算太高，但如果遇到数字超过10的野兽的话……",
        "> 咦，您连数量级的概念都忘记了？……竟然如此严重…我想您可能有必要听一听，毕竟这可是生活在这个世上的基本常识…",
        "> 我一直负责为村里的大家传授基本的数学知识——从皮亚诺公理开始到实数理论，我对自己的授课水平还是有自信的。",
        "> 我会尽量说得简洁明了，如果你不急着干别的，我们现在就开始吧：数字学概论101——"
    ],

    "p12": [
        "> 据说，造物主在创造万物时，为每件物体都赋予了一个内在的属性，也就是<b>数字</b>。",
        "> 数字最直接的体现就是物理尺度。例如，同样是一棵树，数字10的树，长宽高都是数字1的树的10倍。很直观吧？",
        "> 例如，本人的数字就是准确的1，我们村里的一切物体也都在0.9~1.1的范围内。一个地区内的事物有着相近的数字，这种现象一般被称为<b>数量级效应</b>。",
        "> 而走出这个村子，外面的世界就危险得多了。最近的原野虽然也有与我们相近的野兽，但若迷路走到深处，可能会遇到数字达到10、100，甚至更高的生物。",
        "> 数字差达到那种地步，就算只是被不小心踩上一脚，就会当场丧命的，连逃命的机会都没有。",
        "> 而你醒来见到的那片海，则据说越往深处数量级越高，中心处甚至高达1e100——这已经远远超出我们人类可以想象的尺度了。",
        "> 不仅是野兽，也有数量级更高的人类存在，但幸好他们不会对我们的小村子起什么歹念，我们还能过上比较平静的生活。",
        "> 原因很简单，随数字的上升，生存所需的资源也会呈立方上涨。一只数字5的狼，体重就是数字1的125倍，所要吃的食物也是原先的125倍。",
        "> 除了食物，金子也是一样，我们这里的1金币，到数量级10的镇里，就只有0.001倍的购买力。所以劫掠我们这种村庄，也不会有什么好处吧。",
        "> 最后，还有比较难理解的一点——数字不仅会增加物理尺度，还会直接加快时间流速。",
        "> 据说，数字更高的人类，一切行动都会变快。——不是因为身材高大而变快，而是整个生命体的时间流逝都会更快——不过我无法亲身体验，也说不清那究竟是什么意思。",
        "> ……我为什么会知道这么多…？……曾经有位旅客，路过这里时和我聊了一会——他当时对这里很有兴趣，说这里是很罕见的，数量级精确为1的地区。",
        "> 他离开后，我觉得关于数字的理论很有意义，就告诉了这里的村民和孩子们。",
        "> 不过，我唯一不明白的是，究竟是谁定义了<b>1的标准</b>。为什么把这里的数量级定义为1，而不是10或者0.1呢……不过对村里的大家来说，这都算不上什么大问题吧。"
    ],

    "p13": [
        "闲坐的大叔: 唷，你是哪来的？海那边？你居然没卷进浪里死掉，真是有福气。过来过来，让我蹭蹭你的福气，下回玩牌用得上——",
        "端酒的店员: 本店的麦酒味道如何？这次是高数字的大粒小麦，用了新的酿酒法，老板娘很想听听大家的评价——",
        "兼职冒险家: 你是冒险者？唉，真好啊，我们这么个小破地方，连正经的任务都接不到，想学雪狼当什么传奇佣兵都没机会啊。来来来，讲讲你的传奇故事——失忆？切。那算了。",
        "休憩的裁缝: 别过来！！我在编故事，正到精彩的地方呢，全给你打岔打断了。你问我怎么不写下来？蠢货——会被虫子吃光的不知道吗？",
        "托腮的小孩: ……村子外面到底有什么呢？我只知道一边是海、一边是平原，但是，村长说我们就算游一辈子、走一辈子，也见不到更外面的世界……",
        "呢喃的醉客: ………至上的真龙………阿列夫……保佑……………………",
        "不醉的铁匠: 外人呐。好久没见过了。上次来村里的外人，花一笔大钱买走我的磨刀石。你说，他到底图什么？",
        "苦恼的猎人: 唉……那虫子到底是从哪冒出来的呢…好不容易找到半页卷轴……连看一眼都没来得及……",
    ],

    "p14": [
        "流浪汉接过你的食物，什么都没说。",
        "流浪汉接过你的食物，打了个哈欠。",
        "流浪汉接过你的食物，躺在了地上。",
        "流浪汉接过你的食物，翘起二郎腿。",
        "流浪汉接过你的食物，抠了抠鼻孔。",
        "流浪汉接过你的食物，继续晒太阳。",
        "流浪汉接过你的食物，哼起了小曲。",
        "流浪汉接过你的食物，吹起了口哨。"
    ]
}

var zone_desc = {
    "mpcave": {
        name: "洞穴",
        prog: [
            "沿着潮湿的陡坡，你发现一处通向地下的洞穴。洞窟上悬挂着破布做成的旗帜，这正是一群哥布林的据点。",
            "解决掉遇到的敌人，继续深入。洞窟越到深处，越显得宽阔。",
            "又干掉一个，头目想必就在前方了。",
            "战斗结束，你握紧手中的武器，突然感受到掌心多出了某种坚硬的物体——是何时出现的呢？"
        ]
    },
    "mpcave": {
        name: "动物集落",
        prog: [
            "",
            "",
            "",
            "",
            ""
        ]
    },
    "mpcave": {
        name: "安娜的秘密基地",
        prog: [
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    },
}