var full_dialogue = {
    "p11": [
        "> 您是旅行者吗？作为村长的我本该来亲自迎接，但……真不巧，我还在给孩子们授课，实在抽不开身。您此行准备前往哪里？",
        "> 失忆？这……太不妙了…你是从海里来的？这可真稀奇……想必你一定有过什么奇遇吧。",
        "> 总之，如果您想在村子里多停留一段时间，我可以和大家打声招呼，让他们多关照。",
        "> 不过，您最好不要轻易走出村子……没有记忆的话，去村外的原野是很危险的，虽然这附近的数量级都不算太高，但如果遇到数字超过10的野兽的话……",
        "> 咦，您连数量级的概念都忘记了？……竟然如此严重…我想您可能有必要听一听，毕竟这可是生活在这个世上的基本常识…",
        "> 我一直负责为村里的大家传授基本的数学知识——从皮亚诺公理开始到实数理论，我对自己的授课水平还是有自信的。",
        "> 我会尽量说得简洁明了，如果你不急着干别的，我们现在就开始吧：数字学概论101——"
    ],

    "p12": [
        "> 据说，造物主在创造万物时，为每件物体都赋予了一个内在的属性，也就是<b>数字</b>。",
        "> 数字最直接的体现就是物理尺度。例如，同样是一棵树，数字10的树，长宽高都是数字1的树的10倍。很直观吧？",
        "> 例如，本人的数字就是准确的1，我们村里的一切物体也都在0.9~1.1的范围内。一个地区内的事物有着相近的数字，这种现象一般被称为<b>数量级效应</b>。",
        "> 而走出这个村子，外面的世界就危险得多了。最近的原野虽然也有与我们相近的野兽，但若迷路走到深处，可能会遇到数字达到10、100，甚至更高的生物。",
        "> 数字差达到那种地步，就算只是被不小心踩上一脚，就会当场丧命的，连逃命的机会都没有。",
        "> 而你醒来见到的那片海，则据说越往深处数量级越高，中心处甚至高达1e100——这已经远远超出我们人类可以想象的尺度了。",
        "> 不仅是野兽，也有数量级更高的人类存在，但幸好他们不会对我们的小村子起什么歹念，我们还能过上比较平静的生活。",
        "> 原因很简单，随数字的上升，生存所需的资源也会呈立方上涨。一只数字5的狼，体重就是数字1的125倍，所要吃的食物也是原先的125倍。",
        "> 除了食物，金子也是一样，我们这里的1金币，到数量级10的镇里，就只有0.001倍的购买力。所以劫掠我们这种村庄，也不会有什么好处吧。",
        "> 最后，还有比较难理解的一点——数字不仅会增加物理尺度，还会直接加快时间流速。",
        "> 据说，数字更高的人类，一切行动都会变快。——不是因为身材高大而变快，而是整个生命体的时间流逝都会更快——不过我无法亲身体验，也说不清那究竟是什么意思。",
        "> ……我为什么会知道这么多…？……曾经有位旅客，路过这里时和我聊了一会——他当时对这里很有兴趣，说这里是很罕见的，数量级精确为1的地区。",
        "> 他离开后，我觉得关于数字的理论很有意义，就告诉了这里的村民和孩子们。",
        "> 不过，我唯一不明白的是，究竟是谁定义了<b>1的标准</b>。为什么把这里的数量级定义为1，而不是10或者0.1呢……不过对村里的大家来说，这都算不上什么大问题吧。"
    ],

    "p13": [
        "闲坐的大叔: 唷，你是哪来的？海那边？你居然没卷进浪里死掉，真是有福气。过来过来，让我蹭蹭你的福气，下回玩牌用得上——",
        "端酒的店员: 本店的麦酒味道如何？这次是高数字的大粒小麦，用了新的酿酒法，老板娘很想听听大家的评价——",
        "兼职冒险家: 你是冒险者？唉，真好啊，我们这么个小破地方，连正经的任务都接不到，想学雪狼当什么传奇佣兵都没机会啊。来来来，讲讲你的传奇故事——失忆？切。那算了。",
        "休憩的裁缝: 别过来！！我在编故事，正到精彩的地方呢，全给你打岔打断了。你问我怎么不写下来？蠢货——会被虫子吃光的不知道吗？",
        "托腮的小孩: ……村子外面到底有什么呢？我只知道一边是海、一边是平原，但是，村长说我们就算游一辈子、走一辈子，也见不到更外面的世界……",
        "呢喃的醉客: ………至上的真龙………阿列夫……保佑……………………",
        "不醉的铁匠: 外人呐。好久没见过了。上次来村里的外人，花一笔大钱买走我的磨刀石。你说，他到底图什么？",
        "苦恼的猎人: 唉……那虫子到底是从哪冒出来的呢…好不容易找到半页卷轴……连看一眼都没来得及……",
    ],

    "p14": [
        "流浪汉接过你的食物，什么都没说。",
        "流浪汉接过你的食物，打了个哈欠。",
        "流浪汉接过你的食物，躺在了地上。",
        "流浪汉接过你的食物，翘起二郎腿。",
        "流浪汉接过你的食物，抠了抠鼻孔。",
        "流浪汉接过你的食物，继续晒太阳。",
        "流浪汉接过你的食物，哼起了小曲。",
        "流浪汉接过你的食物，吹起了口哨。"
    ],

    "mp21": [
        "在你面前的是一长串的皮制帐篷。这些帐篷尺寸不一，仅凭目测，大小帐篷之间差距可能就有十倍以上。在帐篷群中，居住着数字不等的一帮猎人，他们热情地与你谈论狩猎的心得。",
        "猎人们只对与自己数量级相符的猎物感兴趣。太小的猎物没赚头又会遭人嘲笑，太大的猎物则容易搭上性命。所以这群人意外地没闹出什么纠纷。",
        "猎人教导了制造狩猎工具的技巧。由于每人数字尺寸都不等，没法使用标准化的工具，自己造出趁手的弓弩显得无比重要。",
        "对在这片原野上生存的人们而言，高数字的生物十分危险。幸好猎人中有两位数字达到四十的巨人，足以震慑附近的野兽。",
        "通过植被判断地区的数量级，根据地面痕迹掌握野兽的品种和数字，你学到不少实用的技术。",
        "原野的更深处有着更巨大的生物群落，它们山般庞大的影子时常在极远处显现。对无法改变自身数字的猎人们来说，那是绝对不可触及的存在。",
        "砍树、纺织、挖矿、冶炼，猎人中有着各种各样的人才。在他们的帮助下，或许可以结束低效的重复劳动了。",
        "最近，猎人中出现了某个传闻。不远处的某个村落，不知何时起所有居民都不知去向。现在，有人正盘踞着那个本该无人的村落。",
        "据说，敢走进那无人村落的，无论是动物还是旅人，都会被捕获，然后剥下外皮。如果侥幸能活下来，会被继续驯养，或被杀死做成食物。",
        "猎人们为那个村落中的狂人起了绰号。它被称为“农场主”。任何有理智的家伙，都会选择绕开那个“农场”吧。"
    ],

    "mp22": [
        "> 我看到了你的战斗，表现得很漂亮嘛。可怜的老头，不仅生前疯了，死后也要被这些虫子吃得一干二净。",
        "> 这种虫子叫欧米伽虫——据说欧米伽这个符号就是出自于它。生前它蠕动的样子被记录为ω,死后蜷缩的模样则被写作Ω.",
        "> 欧米伽虫唯一的食物就是知识。一切被书写在某种表面上的文字，都会被它们盯上，然后吃掉——呵呵，世上也有它们消化不了的东西就是了。",
        "> 我本来想看看这位“农场主”悟出了怎样的真理……但可惜，还是来迟了一步。",
        "> 嗯？你还不明白吗？这个老头剥下生物的毛皮，唯一的目的就是晒干了，当作纸来用——啊，纸这个字，也已经快被人忘得差不多了吧。",
        "> 为了造纸就做出这种事，所以说老头一定是有很重要的东西要写才对。不过，被你这么随便干掉，想必也没什么厉害的。",
        "> 好了，是时候说再见咯，果然数量级这么小的地方，从一开始就没什么关注的价值。倒是你，还值得期待一下呢。",
        "> 你手里的那枚符号，可是有着超过你想象的价值。凑近一点吧，让我来给予你，释放它的力量。"
    ]
}

var zone_desc = {
    "mpcave": {
        name: "洞穴",
        prog: [
            "沿着潮湿的陡坡，你发现一处通向地下的洞穴。洞窟上悬挂着破布做成的旗帜，这正是一群哥布林的据点。",
            "解决掉遇到的敌人，继续深入。洞窟越到深处，越显得宽阔。",
            "又干掉一个，头目想必就在前方了。",
            "战斗结束，你握紧手中的武器，突然感受到掌心多出了某种坚硬的物体——是何时出现的呢？"
        ]
    },
    "mphorde": {
        name: "“农场”",
        prog: [
            "靠近这过于安静的村子恐怕不是好主意。村外附近没有任何飞禽走兽，更没有人烟。踏入正门的一瞬，一只失去了皮毛的，肌肉脂肪裸露的野兽盯上了你。",
            "村中到处都是悬挂着晾晒的大小毛皮。其中也有一些没有毛的皮肤。然而，村子的主人“农场主”还并未现身。",
            "又打倒一只野兽，你走到装着笼子的院中。房内，一个披头散发的男子，正俯在桌上不知在做什么。察觉到你的到来，他转过身，满是血丝的双眼与你相对。",
            "“农场主”已经败在你的手上。但随着一阵吱呀声——房间的木门倒下了。门后，涌入了黑压压的某种生物。那是成群的蠕虫——它们瞬间吞没了桌椅，并且，向你涌了过来。",
            "被击溃的虫群如有意识四散逃离。直到这时，你才发现有人正站在你的身后。或许，这人能解答你的疑问。"
        ]
    },
    "mpannazone": {
        name: "安娜的秘密基地",
        prog: [
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    },
}